app/views/users/show.html.erb

  <div class='js-items-count'>
    <%= pluralize(@user.items.count, 'task') %> to do!
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]