app/views/items/destroy.js.erb

DELETE FROM "items" WHERE "items"."id" = ?  [["id", 12]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 1]]
---
<% if @item.destroyed? %>
  $('#item-' +<%= @item.id %>).hide();
  $('.js-items-count').html("<%= pluralize(@item.user.items.count,'tasks') %> to do!");