app/controllers/items_controller.rb

INSERT INTO "items" ("name", "description", "due_date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "to ddo"], ["description", "fdsafdas"], ["due_date", "2015-07-13"], ["user_id", 1], ["created_at", "2015-07-10 05:48:00.872496"], ["updated_at", "2015-07-10 05:48:00.872496"]]
---
  def create
    @item = current_user.items.new(item_params)
    @item.completed = false
    authorize @item
    if @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 7]]
---
  def destroy
    @item = Item.find(params[:id])
    @user = @item.user
    authorize @item
    if @item.destroy